In [85]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
import warnings
from pylab import rcParams
from scipy.stats import f_oneway
from scipy.stats import ttest_ind

In [196]:
solsea = pd.read_csv("solsea.csv")

In [197]:
opensea = pd.read_csv("opensea.csv")

In [198]:
solsea.drop('Unnamed: 0', axis=1, inplace=True)

In [200]:
#solsea_sample = solsea.sample(15)
solsea = solsea.dropna()
solsea['Growth'] = solsea.apply(lambda row: row['30dAvg Price']  / row['Floor Price'] , axis=1)
solsea.head()

,Title,30dVolume,30dSales,30dAvg Price,Floor Price,Items,Growth
0,I'M AIKO,4411.81,1172,3.76,2.49,1087,1.510040
1,Dapper Apes,901.12,260,3.47,2.95,20,1.176271
2,OG Astro Babies,602.83,215,2.80,1.65,92,1.696970
3,Message Party,600.15,190,3.16,2.20,7,1.436364
4,Astro Baby Apes,587.06,411,1.43,0.70,178,2.042857

In [201]:
#opensea_sample = opensea.sample(15)
opensea = opensea.dropna()
opensea['Growth'] = opensea.apply(lambda row: row['30dAvg Price']  / row['Floor Price'] , axis=1)
opensea.head()

,Title,30dVolume,30dSales,30dAvg Price,Floor Price,Items,Growth
0,Karafuru,35848.15,8784.0,4.08,2.30,5554.0,1.773913
1,Azuki,34218.46,2476.0,13.82,9.99,10000.0,1.383383
2,Bored Ape,31983.18,299.0,106.97,82.00,10000.0,1.304512
4,Invisible Friends,29476.04,3334.0,8.84,8.30,5000.0,1.065060
5,Clonex,28571.53,1514.0,18.87,12.00,18961.0,1.572500

In [246]:
#https://www.pythonfordatascience.org/independent-samples-t-test-python/

import researchpy as rp

summary, results = rp.ttest(group1= solsea['Growth'].sample(15), group1_name= "Solsea",
                         group2= opensea['Growth'].sample(15), group2_name= "Opensea")
print(summary)

   Variable     N      Mean        SD        SE  95% Conf.  Interval
0    Solsea  15.0  2.425570  2.320568  0.599168   1.140482  3.710658
1   Opensea  15.0  1.638040  0.989948  0.255604   1.089825  2.186255
2  combined  30.0  2.031805  1.798102  0.328287   1.360382  2.703227

H0 - growth in SOL collections less than or equal ETH ; H1 - growth in SOL collections greater than ETH

In [248]:
sample_size = 15
solsea_sampled = np.random.choice(solsea['Growth'], sample_size)
opensea_sampled = np.random.choice(opensea['Growth'], sample_size)

def compare_2_groups(solsea, opensea, alpha, sample_size):
    stat, p = ttest_ind(solsea, opensea, alternative = "greater")
    print('Statistics=%.3f, p=%.3f' % (stat, p))
    if p > alpha:
        print('fail to reject H0')
    else:
        print('reject H0')

compare_2_groups(solsea_sampled, opensea_sampled, 0.05, sample_size)

Statistics=0.694, p=0.247
fail to reject H0